{
  "experience": [
    {
      "company": "Rochester Institute of Technology",
      "location": "Rochester, NY",
      "position": "Full-Stack Web Engineer",
      "startDate": "June 2025",
      "endDate": "August 2025",
      "description":"RIT needed a centralized location to allow faculty to better find suitable candidates for open Teaching Assistant positions and for current TAs to better access course related responsibilities. Developed a full-stack Next.js-based Course Assistant portal as part of a 4-person team.",
      "responsibilities": [
        "Designed a user workflow engine, translating requirements into technical specifications and working solutions",
        "Implemented backend calls and constructed main frontend portal and common usability standards",
        "Resulting application met stakeholder requirements with plans for release to entire department"
      ],
      "skills": [
        "NextJS",
        "MariaDB",
        "MySQL",
        "Prisma",
        "Docker",
        "System Design"
      ],
      "relevant": true
    },
    {
      "company": "Wegmans Food Markets",
      "location": "Rochester, NY",
      "position": "IT Automation Engineer",
      "startDate": "June 2023",
      "endDate": "December 2023",
      "description":"Brought on to reduce manual processing overhead and improve efficiency across the IT department where they experienced high volumes of repetitive data transformations. Worked with a team of 4 Engineers to Implement automation using XSLT and XPATH to streamline business processes.",
      "responsibilities": [
        "Conducted process review, technical documentation, application administration, and testing",
        "Utilized automation orchestration tools to implement system designs, streamlining tasks such as server decommissioning",
        "Enhanced overall team velocity metric resulting in 20% reduction of ticket turn around time"
      ],
      "skills": [
        "Azure DevOps",
        "XSLT",
        "XPATH",
        "XML",
        "JSON",
        "Process Automation",
        "Linux",
        "API Design and Integration",
        "Agile Development",
        "Scrum"
      ],
      "relevant": true
    },
    {
      "company": "Rochester Institute of Technology",
      "location": "Rochester, NY",
      "position": "Alumni Relations Representative",
      "startDate": "September 2022",
      "endDate": "May 2023",
      "responsibilities": [
        "Contacted alumni of the school to raise money, raising on average $61 per hour for the institution",
        "Maintained a positive and professional tone to build rapport, strengthen alumni relations, and promote continued engagement with the institution.",
        "Accurately recorded call outcomes and donor information in CRM software, ensuring data integrity and compliance with privacy standards."
      ],
      "skills": [
        "Communication",
        "CRM Software",
        "Data Entry",
        "Customer Service",
        "Fundraising",
        "Conflict Resolution"
      ],
      "relevant": false
    },
    {
      "company": "Rochester Institute of Technology",
      "location": "Rochester, NY",
      "position": "Orientation Leader",
      "startDate": "August 2022",
      "endDate": "August 2022",
      "responsibilities": [
        "Led ice breaker activities for 25 new students",
        "Served as a guide and role model for new students"
      ],
      "skills": [
        "Leadership",
        "Event Coordination",
        "Team Collaboration",
        "Communication",
        "Mentorship"
      ],
      "relevant": false
    },
    {
      "company": "JP Morgan Chase",
      "location": "Virtual",
      "position": "Machine Learning Engineer",
      "startDate": "July 2021",
      "endDate": "August 2021",
      "responsibilities": [
        "Worked in a team of 4 interns to manage request management software",
        "Used Python to develop a machine learning algorithm to predict wait times for user-made requests",
        "Leveraged agile development methods to ensure project completion by the given date"
      ],
      "skills": [
        "Python",
        "Machine Learning",
        "Agile Development",
        "Problem Solving",
        "Team Collaboration"
      ],
      "relevant": true
    }
  ]
}
